//===================================================
//
//NameHunter2[main.cpp]
//Author:Kishimoto Eiji
//
//===================================================
//***************************
//インクルード
//***************************
#include <stdio.h>

//***************************
//プロトタイプ宣言
//***************************
namespace
{
void PressEnter();
}//namespaceはここまで

//===================================================
//メイン関数
//===================================================
void main()
{
	//メッセージ & Enter入力待ち
	printf("\n プログラムを終了します。お疲れさまでした。");
	PressEnter();
}

namespace
{
//---------------------------------------------------
//Enter入力待ち
//---------------------------------------------------
void PressEnter()
{
	printf("\n\n Press Enter");
	rewind(stdin);
	getchar();
}
}